LEXICON = {
    'ready': 'Я готов',
    'start_info': 'Круто! Погнали!',
    'create_group': 'Создание новой группы',
    'my_groups': 'Мои группы',
    'admin_groups': 'Управлять группами',
    'price_1': '1000 - 1500 руб.',
    'price_2': '1500 - 3000 руб.',
    'price_3': '3000 - 5000 руб.',
    'game': 'Замечательно, ты собираешься участвовать в игре: {}\nИгра проходит с {} по {}.\nКраткое описание от '
            'организатора:{}',
    'user_name': 'Для начала скажи, как к тебе можно обращаться?\nНапиши так, чтобы другие игроки могли тебя узнать',
    'email': 'Славно! Теперь напиши свой email',
    'wishlist': 'А сейчас расскажи, что бы ты хотел в подарок :)\nЭто может быть что-то конкретное или же просто что '
                'тебе было бы по душе\n\nОграничения по подаркам:',
    'check_data': 'Отлично, давай проверим, что всё верно:\nИмя: {}\nEmail: {}\nТвои пожелания: {}\n\nВсё правильно?',
    'ok': 'Да, всё верно',
    'mistake': 'Нет, хочу что-то поменять',
    'in_game': 'Превосходно, ты в игре!\n{} мы проведем жеребьевку и ты узнаешь имя и контакты своего тайного друга. '
               '\nЕму и нужно будет подарить подарок!',
    'not_in_game': 'Окей, что надо изменить?',
}
