LEXICON = {
    'greeting': 'Привет, я бот-повелитель Тайных Сант. Больше всего на свете я'
                'люблю друзей и подарки 🎁',
    'ready': 'Я готов',
    'lets_start': 'С моей помощью ты можешь создать группу и организовать '
                  'Тайного Санту с друзьями или семьей 👨‍👩‍👧‍👦, на '
                  'работе 👩‍✈️ или в сообществе 🧘, везде, где есть дорогие '
                  ' тебе люди, с кем ты хочешь разделить радость новогодней '
                  'суеты.\n\nВозглавь новогоднее безумие и стань душой '
                  'этого праздника✨',
    'start_info': 'Круто! Погнали!',
    'create_group': 'Создание новой группы',
    'group_creation_rules': 'Пока все будут собираться в твоей группе и думать'
                            ', что они хотят получить от своего Санты, уже '
                            'зарегистрированные смогут поиграть в снежки ☄️ ('
                            'команда для этого будет в меню [Мои группы]) и '
                            'порадоваться моим шуткам.\n\nКогда все соберутся,'
                            ' ты сможешь запустить Распределение подарков и я '
                            'подберу и разошлю каждому его подопечного 🥷\n\n'
                            'Санта и подопечный даже смогут анонимно '
                            'пообщаться, если они захотят уточнить детали или '
                            'передать привет друг другу.',
    'admin_groups': 'Управлять группами',
    'price_1': '1000 - 1500 руб.',
    'price_2': '1500 - 3000 руб.',
    'price_3': '3000 - 5000 руб.',
    'game': 'Замечательно, ты собираешься участвовать в игре:\n{}\n\n'
            'Игра проходит с {} по {}.\n\n'
            'Краткое описание от организатора:\n{}',
    'user_name': 'Для начала скажи, как к тебе можно обращаться?\n\n'
                 'Напиши так, чтобы другие игроки могли тебя узнать',
    'email': 'Славно! Теперь напиши свой email',
    'wishlist': 'А сейчас расскажи, что бы ты хотел в подарок :)\nЭто может '
                'быть что-то конкретное или же просто что '
                'тебе было бы по душе\n\nОграничения по подаркам:',
    'check_data': 'Отлично, давай проверим, что всё верно:\nИмя: {}\nEmail: '
                  '{}\nТвои пожелания: {}\n\nВсё правильно?',
    'ok': 'Да, всё верно',
    'mistake': 'Нет, хочу что-то поменять',
    'in_game': 'Превосходно, ты в игре!\n{} мы проведем жеребьевку и ты '
               'узнаешь имя и контакты своего тайного друга. \nЕму и нужно '
               'будет подарить подарок!',
    'not_in_game': 'Окей, что надо изменить?',
    'my_groups': 'Мои группы',
    'all_player_groups': 'Список групп, где Вы являетесь участником\n'
                         'Выберите интересующую Вас группу.',
    'no_groups': 'У вас еще нет групп',
    'your_groups': 'Вы администратор в следующих группах: \n',
    'link': 'Теперь ты можешь разослать ссылку своим друзьям и начать '
            'веселье!!!',
    'exit_fsm': 'Нажми /start для возврата на главную',
    # После распределения добаваляем "Ты будешь тайным Сантой для Ник"
    'group_info': 'Название группы - {}\nОписание:\n{}\n\n'
                  'Регистрация на игру {}\n\n'
                  'Стоимость подарка: {}\n\n'
                  'Список желаемых подарков:\n{}\n\n'
                  'Участники:\n{}\n\n'
                  '{}',
    'group_info_btns': 'На главную, Изменить желание, Покинуть группу',
    'change_wishlist': 'Введите и отправьте, пожалуйста, список желаемых '
                       'подарков.',
    'wishlist_is_changed': 'Вы изменили список подарков на следующий:\n{}',
    'wanna_leave_group': 'Вы уверены, что хотите покинуть эту группу?',
    'yes': 'Да',
    'no': 'Нет',
    'successfully_exited': 'Вы успешно покинули группу {}',
    'kb_buttons': ['Управлять группами', 'Мои группы',
                   'Создание новой группы', 'Может задонатим?'],
    'payment': 'Может задонатим?',
    'santa_selection_date': 'А когда все узнают своих подопечных?\n\n'
                            'Пора указать дату в формате ГГГГ-ММ-ДД.',
}
